Repository: SekouD/potranslator
Catalog: docs/locale/*/LC_MESSAGES/contributing.po
Languages: ar, cs, de, fr, ja, pl

source: Contributing
ar: المساهمة
cs: Přispívající
de: Beitragend
fr: Contribuer
ja: 貢献する
pl: Współtworzenie

source: Contributions are welcome, and they are greatly appreciated! Every little bit helps, and credit will always be given.
ar: مساهمات موضع ترحيب ، وأنها تحظى بتقدير كبير! كل القليل من المساعدة ، وسوف يتم منح الائتمان دائما.
cs: Příspěvky jsou vítány a jsou velmi oceňovány! Každá trochu pomáhá a úvěr bude vždy dán.
de: Beiträge sind willkommen, und sie werden sehr geschätzt! Jedes kleine bisschen hilft, und Kredit wird immer gegeben.
fr: Les contributions sont les bienvenues, et elles sont grandement appréciées! Chaque petit coup de pouce aide, et le crédit sera toujours donné.
ja: 寄付は大歓迎です、そして、彼らは大いに感謝しています！少しずつ助けられ、常に信用が与えられます。
pl: Składki są mile widziane i są bardzo cenione! Każda odrobina pomaga, a kredyt zawsze będzie przyznawany.

source: You can contribute in many ways:
ar: يمكنك المساهمة بعدة طرق:
cs: Můžete přispět mnoha způsoby:
de: Sie können auf viele Arten beitragen:
fr: Vous pouvez contribuer de plusieurs façons:
ja: あなたはいろいろな方法で貢献することができます：
pl: Możesz przyczynić się na wiele sposobów:

source: Types of Contributions
ar: أنواع المساهمات
cs: Typy příspěvků
de: Arten von Beiträgen
fr: Types de contributions
ja: 貢献の種類
pl: Rodzaje wkładów

source: Report Bugs
ar: تقرير البق
cs: Nahlásit chyby
de: Fehler melden
fr: Signaler les bugs
ja: レポートのバグ
pl: Zgłoś błędy

source: Report bugs at https://github.com/SekouD/potranslator/issues.
ar: الإبلاغ عن الأخطاء على https://github.com/SekouD/potranslator/issues.
cs: Nahlásit chyby na adrese https://github.com/SekouD/potranslator/issues.
de: Melden Sie Fehler unter https://github.com/SekouD/potranslator/issues.
fr: Rapportez les bugs sur https://github.com/SekouD/potranslator/issues.
ja: バグはhttps://github.com/SekouD/potranslator/issuesで報告してください。
pl: Zgłoś błędy na https://github.com/SekouD/potranslator/issues.

source: If you are reporting a bug, please include:
ar: إذا كنت تبلغ عن خطأ ، فيرجى تضمين:
cs: Pokud hlásíte chybu, uveďte prosím:
de: Wenn Sie einen Fehler melden, geben Sie Folgendes an:
fr: Si vous signalez un bug, veuillez inclure:
ja: バグを報告している場合は、以下を含めてください：
pl: Jeśli zgłaszasz błąd, dołącz:

source: Your operating system name and version.
ar: اسم نظام التشغيل وإصداره.
cs: Název a verze operačního systému.
de: Ihr Betriebssystem Name und Version.
fr: Le nom et la version de votre système d'exploitation.
ja: お使いのオペレーティングシステムの名前とバージョン。
pl: Twoja nazwa i wersja systemu operacyjnego.

source: Any details about your local setup that might be helpful in troubleshooting.
ar: أي تفاصيل حول إعدادك المحلي قد تكون مفيدة في استكشاف الأخطاء وإصلاحها.
cs: Podrobnosti o místním nastavení, které mohou pomoci při odstraňování problémů.
de: Alle Details zu Ihrer lokalen Konfiguration, die bei der Fehlerbehebung hilfreich sein können.
fr: Tous les détails concernant votre configuration locale qui pourraient être utiles pour le dépannage.
ja: トラブルシューティングに役立つローカルセットアップに関する詳細。
pl: Dowolne szczegóły dotyczące lokalnej konfiguracji, które mogą być pomocne w rozwiązywaniu problemów.

source: Detailed steps to reproduce the bug.
ar: خطوات تفصيلية لإعادة إنشاء الخطأ.
cs: Podrobné kroky k reprodukci chyby.
de: Detaillierte Schritte zum Reproduzieren des Fehlers.
fr: Étapes détaillées pour reproduire le bug.
ja: バグを再現するための詳細な手順。
pl: Szczegółowe kroki w celu odtworzenia błędu.

source: Fix Bugs
ar: إصلاح الأخطاء
cs: Opravte chyby
de: Fehler beheben
fr: Corriger les bugs
ja: バグ修正
pl: Naprawić błędy

source: Look through the GitHub issues for bugs. Anything tagged with "bug" and "help wanted" is open to whoever wants to implement it.
ar: ابحث في مشكلات GitHub عن الأخطاء. أي شيء تم وضع علامة عليه بـ "bug" و "help want" مفتوح لمن يريد تنفيذه.
cs: Podívejte se na chyby GitHubu. Vše označené "bug" a "help wanted" je otevřené každému, kdo jej chce implementovat.
de: Sehen Sie sich die GitHub-Probleme an. Alles, was mit "bug" und "help wanted" getaggt ist, steht jedem offen, der es implementieren will.
fr: Regardez sur le site GitHub du projet pour les bugs. Tout ce qui est marqué "bug" et "help wanted" est ouvert à quiconque veut l'implémenter.
ja: GitHubのバグの問題を見てください。 「バグ」と「ヘルプが必要」とタグ付けされたものは誰でも、それを実装したいと思っている人には公開されています。
pl: Przejrzyj problemy z GitHub w poszukiwaniu błędów. Wszystko oznaczone "bug" i "help wanted" jest otwarte dla każdego, kto chce to zaimplementować.

source: Implement Features
ar: تنفيذ الميزات
cs: Implementujte funkce
de: Funktionen implementieren
fr: Implémenter de nouvelles fonctionnalités
ja: 機能を実装する
pl: Wdróż funkcje

source: Look through the GitHub issues for features. Anything tagged with "enhancement" and "help wanted" is open to whoever wants to implement it.
ar: ابحث في مشكلات GitHub عن الميزات. أي شيء تم وضع علامة عليه بـ "التحسين" و "المساعدة المطلوبة" مفتوح لمن يريد تنفيذه.
cs: Podívejte se na problémy s funkcí GitHub. Cokoliv, co je označeno "vylepšením" a "hledanou pomoc", je otevřeno pro každého, kdo jej chce implementovat.
de: Sehen Sie sich die GitHub-Ausgaben für Funktionen an. Alles, was mit "Enhancement" und "help wanted" gekennzeichnet ist, steht jedem offen, der es implementieren möchte.
fr: Regardez sur la page GitHub du projet pour les fonctionnalités. Tout ce qui est marqué "amélioration" et "help wanted" est ouvert à quiconque veut l'implémenter.
ja: 機能についてはGitHubの問題を見てください。 「強化」と「援助したい」というタグが付いているものは、誰でもそれを実装したいと思う人には公開されています。
pl: Przejrzyj problemy z GitHub dla funkcji. Wszystko oznaczone "ulepszeniem" i "potrzebną pomocą" jest otwarte dla każdego, kto chce to zaimplementować.

source: Write Documentation
ar: كتابة الوثائق
cs: Napište dokumentaci
de: Dokumentation schreiben
fr: Écrire de la documentation
ja: ドキュメントを書く
pl: Napisz dokumentację

source: potranslator could always use more documentation, whether as part of the official potranslator docs, in docstrings, or even on the web in blog posts, articles, and such.
ar: يمكن أن يستخدم potranslator دائمًا مزيدًا من الوثائق ، سواء كجزء من مستندات potranslator الرسمية ، في المستندات ، أو حتى على الويب في مشاركات المدونات والمقالات.
cs: Překladatel by mohl vždy používat více dokumentů, ať již jako součást oficiálních dokladů pro překlady, v dokumentech, nebo dokonce i na webu v blogových příspěvcích, článcích a podobně.
de: Potranslator könnte immer mehr Dokumentation verwenden, sei es als Teil der offiziellen Potranslator-Dokumentation, in Docstrings oder sogar im Web in Blogposts, Artikeln und so weiter.
fr: potranslator pourrait toujours utiliser plus de documentation, que ce soit dans le cadre de la doc officielle de potranslator, dans les docstrings, ou même sur le web dans des articles de blog, et autres.
ja: 翻訳者は、公式の翻訳者ドキュメント、ドキュメントストリング、ブログ記事、記事などのウェブ上であっても、常により多くのドキュメントを使用することができます。
pl: potranslator może zawsze korzystać z większej ilości dokumentacji, zarówno w ramach oficjalnych dokumentów potranslatora, w docstrings, a nawet w sieci w postach na blogu, artykułach i tym podobnych.

source: Submit Feedback
ar: إرسال ملاحظات
cs: Odeslat komentář
de: Feedback senden
fr: Soumettre des commentaires
ja: フィードバックを送信
pl: Prześlij opinię

source: The best way to send feedback is to file an issue at https://github.com/SekouD/potranslator/issues.
ar: أفضل طريقة لإرسال التعليقات هي تقديم مشكلة على https://github.com/SekouD/potranslator/issues.
cs: Nejlepší způsob, jak odeslat zpětnou vazbu, je podat problém na adrese https://github.com/SekouD/potranslator/issues.
de: Der beste Weg, Feedback zu senden, besteht darin, ein Problem unter https://github.com/SekouD/potranslator/issues zu melden.
fr: La meilleure façon d'envoyer vos commentaires est de déposer un problème sur https://github.com/SekouD/potranslator/issues.
ja: フィードバックを送信する最善の方法は、https://github.com/SekouD/potranslator/issuesで問題を提出することです。
pl: Najlepszym sposobem na przesłanie opinii jest zgłoszenie problemu na stronie https://github.com/SekouD/potranslator/issues.

source: If you are proposing a feature:
ar: إذا كنت تقترح ميزة:
cs: Pokud navrhujete funkci:
de: Wenn Sie ein Feature vorschlagen:
fr: Si vous proposez une fonctionnalité:
ja: フィーチャーを提案している場合：
pl: Jeśli proponujesz funkcję:

source: Explain in detail how it would work.
ar: اشرح بالتفصيل كيف ستعمل.
cs: Vysvětlete podrobně, jak to bude fungovat.
de: Erklären Sie im Detail, wie es funktionieren würde.
fr: Expliquez en détail comment cela fonctionnerait.
ja: それがどのように機能するかを詳細に説明してください。
pl: Wyjaśnij szczegółowo, jak to będzie działać.

source: Keep the scope as narrow as possible, to make it easier to implement.
ar: حافظ على نطاق ضيق قدر الإمكان ، لتسهيل التنفيذ.
cs: Zajistěte, aby byl rozsah co nejužší, abyste usnadnili jeho implementaci.
de: Halten Sie den Umfang so eng wie möglich, um die Implementierung zu erleichtern.
fr: Gardez la portée aussi étroite que possible, pour rendre la fonctionnalité plus facile à mettre en œuvre.
ja: スコープをできるだけ狭くしておくと、実装が簡単になります。
pl: Zachowaj możliwie wąski zakres, aby ułatwić jego wdrożenie.

source: Remember that this is a volunteer-driven project, and that contributions are welcome :)
ar: تذكر أن هذا هو مشروع يحركه المتطوعون ، وأن المساهمات هي موضع ترحيب :)
cs: Nezapomeňte, že je to projekt založený na dobrovolnictví a že příspěvky jsou vítány :)
de: Denken Sie daran, dass dies ein freiwilliges Projekt ist und dass Beiträge willkommen sind :)
fr: Rappelez-vous que c'est un projet dirigé par des bénévoles, et que les contributions sont les bienvenues :)
ja: これはボランティア主導のプロジェクトであり、貢献は歓迎します:)
pl: Pamiętaj, że jest to projekt oparty na wolontariacie i ten wkład jest mile widziany :)

source: Get Started!
ar: البدء!
cs: Začít!
de: Loslegen!
fr: Commencez!
ja: 始めよう！
pl: Zaczynać!

source: Ready to contribute? Here's how to set up `potranslator` for local development.
ar: على استعداد للمساهمة؟ فيما يلي كيفية إعداد `potranslator` للتنمية المحلية.
cs: Jste připraveni přispět? Zde je návod, jak nastavit "postranslator" pro místní rozvoj.
de: Bereit zum Beitrag? Hier erfahren Sie, wie Sie den "Potranslator" für die lokale Entwicklung einrichten.
fr: Prêt à contribuer? Voici comment configurer `potranslator` pour le développement local.
ja: 貢献する準備ができましたか？ローカル開発のために `potranslator 'を設定する方法は次のとおりです。
pl: Gotowy do wniesienia? Oto jak skonfigurować `potranslator` dla lokalnego rozwoju.

source: Fork the `potranslator` repo on GitHub.
ar: شوكة `repranslator` ريبو على جيثب.
cs: Proveďte repo operátora GITHub.
de: Fork den `Potranslator` Repo auf GitHub.
fr: Forkez le repo `potranslator` sur GitHub.
ja: GitHubで `potranslator`リポジトリをフォークします。
pl: Rozwiąż rePO `potranslator` na GitHub.

source: Clone your fork locally::
ar: استنساخ شوكتك محليًا ::
cs: Klonujte svou vidličku lokálně ::
de: Klonen Sie Ihre Gabel lokal:
fr: Cloner votre fork localement ::
ja: ローカルでフォークをクローン::
pl: Sklonuj widelec lokalnie ::

source: Install your local copy into a virtualenv. Assuming you have virtualenvwrapper installed, this is how you set up your fork for local development::
ar: تثبيت نسختك المحلية في virtualenv. بافتراض تثبيت virtualenvwrapper ، هذه هي طريقة إعداد الشوكة الخاصة بك للتنمية المحلية:
cs: Nainstalujte místní kopii do virtuální paměti. Za předpokladu, že máte nainstalován virtualenvwrapper, tak si nastavíte vidlici pro místní rozvoj ::
de: Installiere deine lokale Kopie in ein virtualenv. Angenommen, Sie haben virtualenvwrapper installiert, so richten Sie Ihren fork für lokale Entwicklung ein:
fr: Installez votre copie locale dans un virtualenv. En supposant que virtualenvwrapper soit installé, voici comment configurer votre fork pour le développement local:
ja: ローカルコピーをvirtualenvにインストールします。 virtualenvwrapperがインストールされていると仮定すると、ローカル開発用にフォークを設定する方法です::
pl: Zainstaluj lokalną kopię w virtualenv. Zakładając, że masz zainstalowany virtualenvwrapper, tak skonfigurujesz widelec do lokalnego rozwoju:

source: Create a branch for local development::
ar: إنشاء فرع للتنمية المحلية ::
cs: Vytvořit pobočku pro místní rozvoj ::
de: Erstellen Sie eine Niederlassung für lokale Entwicklung ::
fr: Créer une branche pour le développement local ::
ja: ローカル開発のためのブランチを作成する::
pl: Utwórz oddział dla rozwoju lokalnego ::

source: Now you can make your changes locally.
ar: الآن يمكنك إجراء تغييراتك محليًا.
cs: Nyní můžete provést změny místně.
de: Jetzt können Sie Ihre Änderungen lokal vornehmen.
fr: Vous pouvez maintenant effectuer vos modifications localement.
ja: これで、ローカルで変更を加えることができます。
pl: Teraz możesz wprowadzić zmiany lokalnie.

source: When you're done making changes, check that your changes pass flake8 and the tests, including testing other Python versions with tox::
ar: عند الانتهاء من إجراء التغييرات ، تأكد من أن التغييرات التي أجريتها تمر flake8 والاختبارات ، بما في ذلك اختبار إصدارات Python الأخرى مع tox ::
cs: Po dokončení změn zkontrolujte, zda vaše změny procházejí vločkou8 a testy včetně testování jiných verzí Pythonu s tox ::
de: Wenn Sie mit den Änderungen fertig sind, überprüfen Sie, ob Ihre Änderungen flake8 und die Tests bestehen, einschließlich Tests anderer Python-Versionen mit tox ::
fr: Lorsque vous avez fini de faire des changements, vérifiez que vos changements passent flake8 et les tests, y compris le test d'autres versions de Python avec tox ::
ja: 変更が終わったら、変更内容がflake8とtestingを通過していることを確認します。他のPythonのバージョンをtoxでテストすることもできます::
pl: Po wprowadzeniu zmian sprawdź, czy zmiany przekazują flake8 i testy, w tym testowanie innych wersji Pythona z tox ::

source: To get flake8 and tox, just pip install them into your virtualenv.
ar: للحصول على flake8 و tox ، فقط قم بتثبيتها في virtualenv الخاص بك.
cs: Chcete-li dostat flake8 a tox, stačí je nainstalovat do svého virtuálu.
de: Um Flocke8 und Tox zu erhalten, installiere sie einfach in dein virtualenv.
fr: Pour obtenir flake8 et tox, il suffit de les installer dans votre virtualenv.
ja: flake8とtoxを取得するには、それらをvirtualenvにインストールしてください。
pl: Aby uzyskać flake8 i tox, po prostu zainstaluj je w swoim virtualenv.

source: Commit your changes and push your branch to GitHub::
ar: قم بإدخال تعديلاتك وادفع فرعك إلى GitHub ::
cs: Proveďte změny a tlačte svou pobočku do GitHub ::
de: Übernehmen Sie Ihre Änderungen und schieben Sie Ihren Zweig zu GitHub ::
fr: Validez vos changements et faites un push de votre branche vers GitHub ::
ja: 変更をコミットしてブランチをGitHub ::に送ります
pl: Zatwierdź zmiany i popchnij swój oddział do GitHub ::

source: Submit a pull request through the GitHub website.
ar: تقديم طلب سحب عبر موقع GitHub.
cs: Odeslání žádosti o stažení přes web GitHub.
de: Senden Sie eine Pull-Anfrage über die GitHub-Website.
fr: Soumettez une pull request sur le site Web de GitHub.
ja: GitHubのウェブサイトからプルリクエストを提出してください。
pl: Prześlij żądanie ściągnięcia za pośrednictwem strony GitHub.

source: Pull Request Guidelines
ar: سحب توجيهات الطلب
cs: Pokyny pro vytištění požadavků
de: Pull Request Richtlinien
fr: Directives des Pull Request
ja: プルリクエストガイドライン
pl: Wytyczne Pull Request

source: Before you submit a pull request, check that it meets these guidelines:
ar: قبل إرسال طلب سحب ، تحقق من استيفائه لهذه الإرشادات:
cs: Než odešlete žádost o stažení, zkontrolujte, zda splňuje tyto pokyny:
de: Bevor Sie eine Pull-Anforderung senden, überprüfen Sie, ob diese Richtlinien erfüllt sind:
fr: Avant de soumettre une pull request, vérifiez qu'elle respecte les consignes suivantes:
ja: プルリクエストを送信する前に、次のガイドラインに従っていることを確認してください：
pl: Zanim prześlesz żądanie pobrania, sprawdź, czy spełnia ono następujące wytyczne:

source: The pull request should include tests.
ar: يجب أن يتضمن طلب السحب الاختبارات.
cs: Požadavek tahu by měl obsahovat testy.
de: Die Pull-Anforderung sollte Tests enthalten.
fr: La pull request doit inclure des tests.
ja: プルリクエストにはテストを含める必要があります。
pl: Żądanie pobrania powinno zawierać testy.

source: If the pull request adds functionality, the docs should be updated. Put your new functionality into a function with a docstring, and add the feature to the list in README.rst.
ar: إذا كان طلب السحب يضيف وظائف ، فيجب تحديث المستندات. ضع وظائفك الجديدة في وظيفة بحرف docstring ، وأضف الميزة إلى القائمة في README.rst.
cs: Pokud požadavek tažení přidá funkčnost, měly by být dokumenty aktualizovány. Dejte nové funkce do funkce s docstring a přidejte funkci do seznamu v souboru README.rst.
de: Wenn die Pull-Anforderung Funktionalität hinzufügt, sollten die Dokumente aktualisiert werden. Fügen Sie Ihre neue Funktionalität in eine Funktion mit einem Docstring ein und fügen Sie sie der Liste in README.rst hinzu.
fr: Si la pull request ajoute une fonctionnalité, la documentation doit être mise à jour. Mettez votre nouvelle fonctionnalité dans une fonction avec une docstring et ajoutez la fonctionnalité à la liste dans README.rst.
ja: プル要求が機能を追加する場合は、ドキュメントを更新する必要があります。新しい機能をドキュメントストリングを含む関数に置き、その機能をREADME.rstのリストに追加します。
pl: Jeśli żądanie pobrania dodaje funkcję, dokumenty powinny zostać zaktualizowane. Umieść nową funkcję w funkcji za pomocą docstrukcji i dodaj funkcję do listy w pliku README.rst.

source: The pull request should work for Python 2.7, 3.4, 3.5 and 3.6, and for PyPy. Check https://travis-ci.org/SekouD/potranslator/pull_requests and make sure that the tests pass for all supported Python versions.
ar: يجب أن يعمل طلب السحب على Python 2.7 و 3.4 و 3.5 و 3.6 و PyPy. تحقق من https://travis-ci.org/SekouD/potranslator/pull_requests وتأكد من اجتياز الاختبارات لجميع إصدارات Python المدعومة.
cs: Požadavek táhnout by měl fungovat pro Python 2.7, 3.4, 3.5 a 3.6 a pro PyPy. Zkontrolujte https://travis-ci.org/SekouD/potranslator/pull_requests a ujistěte se, že testy prošly pro všechny podporované verze Pythonu.
de: Die Pull-Anfrage sollte für Python 2.7, 3.4, 3.5 und 3.6 und für PyPy funktionieren. Überprüfen Sie https://travis-ci.org/SekouD/potranslator/pull_requests und stellen Sie sicher, dass die Tests für alle unterstützten Python-Versionen gelten.
fr: La requête pull devrait fonctionner pour Python 2.7, 3.4, 3.5 et 3.6, et pour PyPy. Vérifiez https://travis-ci.org/SekouD/potranslator/pull_requests et assurez-vous que les tests réussissent pour toutes les versions Python supportées.
ja: プルリクエストは、Python 2.7,3.4,3.5、および3.6、およびPyPyで動作するはずです。 https://travis-ci.org/SekouD/potranslator/pull_requestsをチェックし、テストがサポートされているすべてのPythonバージョンを通過することを確認してください。
pl: Żądanie pobrania powinno działać dla Pythona 2.7, 3.4, 3.5 i 3.6 oraz dla PyPy. Sprawdź https://travis-ci.org/SekouD/potranslator/pull_requests i upewnij się, że testy przechodzą na wszystkie obsługiwane wersje Pythona.

source: Tips
ar: نصائح
cs: Tipy
de: Tipps
fr: Conseils
ja: ヒント
pl: Wskazówki

source: To run a subset of tests::
ar: لتشغيل مجموعة فرعية من الاختبارات ::
cs: Spustit podmnožinu testů ::
de: So führen Sie eine Teilmenge von Tests aus ::
fr: Pour exécuter un sous-ensemble des tests ::
ja: テストのサブセットを実行する::
pl: Aby uruchomić podzestaw testów:

source: Deploying
ar: نشر
cs: Nasazení
de: Bereitstellen
fr: Déployer
ja: 展開
pl: Wdrażanie

source: A reminder for the maintainers on how to deploy. Make sure all your changes are committed (including an entry in HISTORY.rst). Then run::
ar: رسالة تذكير للمشرفين حول كيفية النشر. تأكد من التزام جميع التغييرات (بما في ذلك الإدخال في HISTORY.rst). ثم اركض::
cs: Připomínka pro správce, jak nasadit. Ujistěte se, že byly provedeny všechny změny (včetně položky v souboru HISTORY.rst). Poté spusťte ::
de: Eine Erinnerung für die Betreuer zur Bereitstellung. Stellen Sie sicher, dass alle Ihre Änderungen festgeschrieben sind (einschließlich eines Eintrags in HISTORY.rst). Dann renne::
fr: Un rappel pour les mainteneurs sur la façon de déployer. Assurez-vous que toutes vos modifications sont validées (y compris une entrée dans HISTORY.rst). Puis exécutez ::
ja: 保守担当者にデプロイ方法のリマインダー。すべての変更がコミットされていることを確認してください（HISTORY.rstのエントリを含む）。次に実行::
pl: Przypomnienie dla opiekunów o sposobie wdrażania. Upewnij się, że wszystkie zmiany zostały zatwierdzone (w tym wpis w HISTORY.rst). Następnie uruchomić::

source: Travis will then deploy to PyPI if tests pass.
ar: سينتقل ترافيس بعد ذلك إلى PyPI إذا نجحت الاختبارات.
cs: Travis pak nasadí do PyPI, pokud testy projdou.
de: Travis wird dann in PyPI bereitstellen, wenn Tests bestanden werden.
fr: Travis déploiera ensuite le package sur PyPI si les tests réussissent.
ja: テストが合格するとTravisはPyPIにデプロイします。
pl: Travis następnie wdroży do PyPI, jeśli testy przejdą.
