Repository: SekouD/potranslator
Catalog: docs/locale/*/LC_MESSAGES/installation.po
Languages: ar, ja, pl, zh_cn

source: Installation
ar: التركيب
ja: インストール
pl: Instalacja
zh_cn: 安装

source: Stable release
ar: إصدارة مستقرة
ja: 安定したリリース
pl: Wersja stabilna
zh_cn: 稳定释放

source: To install potranslator, run this command in your terminal:
ar: لتثبيت potranslator ، قم بتشغيل هذا الأمر في الطرفية الخاصة بك:
ja: potranslatorをインストールするには、端末で次のコマンドを実行します。
pl: Aby zainstalować potranslator, uruchom to polecenie w swoim terminalu:
zh_cn: 要安装potranslator，请在终端中运行以下命令：

source: This is the preferred method to install potranslator, as it will always install the most recent stable release.
ar: هذه هي الطريقة المفضلة لترجمة potranslator ، حيث ستقوم دائمًا بتثبيت أحدث إصدار ثابت.
ja: これは、常に最新の安定版リリースをインストールするため、翻訳者をインストールするのに推奨される方法です。
pl: Jest to preferowana metoda instalacji potranslatora, ponieważ zawsze instaluje najnowszą wersję stabilną.
zh_cn: 这是安装potranslator的首选方法，因为它将始终安装最新的稳定版本。

source: If you don't have `pip`_ installed, this `Python installation guide`_ can guide you through the process.
ar: إذا لم يكن لديك `pip`_ مثبتًا ، فإن هذا` دليل تثبيت بايثون` يمكن أن يرشدك خلال العملية.
ja: `pip`がインストールされていない場合、この` Python installation guide`_がプロセスを案内します。
pl: Jeśli nie masz zainstalowanego `pip`_, ten` Przewodnik po instalacji Pythona`_ poprowadzi Cię przez proces.
zh_cn: 如果您没有安装`pip`_，那么这个`Python安装指南`可以指导您完成整个过程。

source: From sources
ar: من المصادر
ja: ソースから
pl: Ze źródeł
zh_cn: 从消息来源

source: The sources for potranslator can be downloaded from the `Github repo`_.
ar: يمكن تنزيل المصادر الخاصة بـ potranslator من `Github repo`_.
ja: 翻訳者のソースは `Github repo`_からダウンロードできます。
pl: Źródła potranslatora można pobrać z `Gitub repo`_.
zh_cn: potranslator的源代码可以从`Github repo`_下载。

source: You can either clone the public repository:
ar: يمكنك إما استنساخ المستودع العام:
ja: パブリックリポジトリをクローンすることもできます：
pl: Możesz sklonować publiczne repozytorium:
zh_cn: 您可以克隆公共存储库：

source: Or download the `tarball`_:
ar: أو قم بتنزيل `tarball`_:
ja: あるいは `tarball`_をダウンロードしてください：
pl: Lub pobierz `tarball`_:
zh_cn: 或者下载`tarball`_：

source: Once you have a copy of the source, you can install it with:
ar: بمجرد الحصول على نسخة من المصدر ، يمكنك تثبيته مع:
ja: ソースのコピーを取得したら、次の方法でインストールできます。
pl: Gdy masz kopię źródła, możesz zainstalować ją za pomocą:
zh_cn: 获得源的副本后，可以使用以下命令安装它：
