Repository: SekouD/potranslator
Catalog: docs/locale/*/LC_MESSAGES/modules.po
Languages: ar, cs, de, es, fr, ja, pl, zh_cn

source: Package Api Documentation for potranslator
ar: حزمة وثائق ابي ل potranslator
cs: Balík Api Dokumentace pro překladač
de: Paket Api Dokumentation für Potranslator
es: Package Api Documentation for potraslator
fr: Documentation de l'API de potranslator
ja: 翻訳者のためのApiドキュメンテーションパッケージ
pl: Pakiet Dokumentacja Api dla potranslatora
zh_cn: 包装Api文件的potranslator

source: API Reference for the classes in potranslator.potranslator.py
ar: مرجع API للفصول الدراسية في potranslator.potranslator.py
cs: Reference API pro třídy v potranslator.potranslator.py
de: API-Referenz für die Klassen in potranslator.potranslator.py
es: Referencia de API para las clases en potranslator.potranslator.py
fr: Référence de l'API pour les classes dans potranslator.potranslator.py
ja: potranslator.potranslator.pyのクラスのAPIリファレンス
pl: Odnośnik API dla klas w potranslator.potranslator.py
zh_cn: potranslator.potranslator.py中类的API参考

source: Main module.
ar: الوحدة الرئيسية.
cs: Hlavní modul.
de: Hauptmodul.
es: Módulo principal.
fr: Module principal
ja: メインモジュール。
pl: Główny moduł.
zh_cn: 主要模块。

source: Bases: :class:`object`
ar: القواعد:: الصنف: `الكائن`
cs: Báze:: třída: `objekt '
de: Basen:: Klasse: `Objekt`
es: Bases:: clase: `objeto`
ja: ベース：：class： `object`
pl: Bazy:: class: `object`
zh_cn: 基础:: class：`object`

source: This is the main class of this library. This class manages all translation tasks.
ar: هذا هو الفصل الرئيسي لهذه المكتبة. يدير هذا الفصل جميع مهام الترجمة.
cs: Toto je hlavní třída této knihovny. Tato třída spravuje všechny překladové úlohy.
de: Dies ist die Hauptklasse dieser Bibliothek. Diese Klasse verwaltet alle Übersetzungsaufgaben.
es: Esta es la clase principal de esta biblioteca. Esta clase maneja todas las tareas de traducción.
fr: C'est la classe principale de cette librairie. Cette classe gère toutes les tâches de traduction.
ja: これはこのライブラリの主要クラスです。このクラスはすべての翻訳タスクを管理します。
pl: To jest główna klasa tej biblioteki. Ta klasa zarządza wszystkimi zadaniami tłumaczeniowymi.
zh_cn: 这是该库的主要类。此类管理所有翻译任务。

source: Parameters
ar: المعلمات
cs: Parametry
de: Parameter
es: Parámetros
fr: Paramètres
ja: パラメーター
pl: Parametry
zh_cn: 参数

source: string. Path to the pot directory.
ar: خيط. المسار إلى دليل وعاء.
cs: řetězec. Cesta do adresáře hrnců.
de: Zeichenfolge. Pfad zum Pot-Verzeichnis.
es: cuerda. Camino al directorio de la olla.
fr: string. Chemin vers le répertoire contenant les fichiers *.pot.
ja: 文字列。 potディレクトリへのパス。
pl: strunowy. Ścieżka do katalogu pot.
zh_cn: 串。 pot目录的路径。

source: string. Path to the locale directory.
ar: خيط. المسار إلى دليل الإعدادات المحلية.
cs: řetězec. Cesta k místnímu adresáři.
de: Zeichenfolge. Pfad zum Gebietsschema-Verzeichnis
es: cuerda. Ruta al directorio de locale
fr: string. Chemin d'accès au répertoire locale.
ja: 文字列。ロケールディレクトリへのパス。
pl: strunowy. Ścieżka do katalogu ustawień regionalnych.
zh_cn: 串。语言环境目录的路径。

source: Translates the given po file in the specified target language.
ar: يترجم ملف po المحدد باللغة المستهدفة المحددة.
cs: Převede daný po soubor v určeném cílovém jazyce.
de: Übersetzt die angegebene po-Datei in der angegebenen Zielsprache.
es: Traduce el archivo po dado en el idioma de destino especificado.
fr: Traduit le fichier po donné dans la langue cible spécifiée.
ja: 与えられたpoファイルを指定されたターゲット言語で翻訳します。
pl: Przetłumaczy dany plik po w określonym języku docelowym.
zh_cn: 以指定的目标语言翻译给定的po文件。

source: string. Path to the filename of the file to translate.
ar: خيط. المسار إلى اسم الملف لترجمة الملف.
cs: řetězec. Cesta k názvu souboru souboru, který chcete přeložit.
de: Zeichenfolge. Pfad zum Dateinamen der zu übersetzenden Datei.
es: cuerda. Ruta al nombre de archivo del archivo a traducir.
fr: string. Chemin vers le nom de fichier du fichier à traduire.
ja: 文字列。変換するファイルのファイル名へのパス。
pl: strunowy. Ścieżka do pliku pliku do przetłumaczenia.
zh_cn: 串。要翻译的文件的文件名的路径。

source: string. Target language for translation.
ar: خيط. اللغة الهدف للترجمة.
cs: řetězec. Cílový jazyk pro překlad.
de: Zeichenfolge. Zielsprache für die Übersetzung.
es: cuerda. Idioma de destino para la traducción.
fr: string. Langue cible pour la traduction.
ja: 文字列。翻訳の対象言語。
pl: strunowy. Język docelowy do tłumaczenia.
zh_cn: 串。翻译的目标语言。

source: string. Source language for translation.
ar: خيط. لغة المصدر للترجمة.
cs: řetězec. Zdrojový jazyk pro překlad.
de: Zeichenfolge. Ausgangssprache für die Übersetzung.
es: cuerda. Idioma de origen para la traducción.
fr: string. Langue source pour la traduction.
ja: 文字列。翻訳元言語。
pl: strunowy. Język źródłowy do tłumaczenia.
zh_cn: 串。翻译的源语言。

source: string. Encoding for saving the po files.
ar: خيط. ترميز لحفظ ملفات po.
cs: řetězec. Kódování pro uložení souborů po.
de: Zeichenfolge. Kodierung zum Speichern der PO-Dateien.
es: cuerda. Codificación para guardar los archivos po.
fr: string. Encodage pour enregistrer les fichiers po.
ja: 文字列。 poファイルを保存するためのエンコーディング。
pl: strunowy. Kodowanie do zapisywania plików PO.
zh_cn: 串。用于保存po文件的编码。

source: bool. Toggles auto save feature.
ar: منطقي. تبديل ميزة الحفظ التلقائي.
cs: bool. Přepíná funkci automatického ukládání.
de: Bool. Schaltet die automatische Speicherfunktion um.
es: bool. Alterna la función de guardar automáticamente.
fr: bool. Active la fonction de sauvegarde automatique.
ja: ブール自動保存機能を切り替えます。
pl: bool. Przełącza funkcję automatycznego zapisywania.
zh_cn: 布尔。切换自动保存功能。

source: bool. Toggles compilation to mo files.
ar: منطقي. يقوم بالتحول إلى ملفات mo.
cs: bool. Přepíše kompilaci do souborů mo.
de: Bool. Schaltet die Kompilierung auf MO-Dateien um.
es: bool. Alterna la compilación a archivos mo.
fr: bool. Active la compilation en fichiers mo.
ja: ブールコンパイルをmoファイルに切り替えます。
pl: bool. Przełącza kompilację do plików mo.
zh_cn: 布尔。将编译切换到mo文件。

source: Returns
ar: عائدات
cs: Vrací
de: Kehrt zurück
es: Devoluciones
fr: Retourne
ja: 返品
pl: Zwroty
zh_cn: 返回

source: tuple. A tuple containing the translated version of the original catalog and the status of the POFile.
ar: الصفوف (tuple). مجموعة تحتوي على النسخة المترجمة من الكتالوج الأصلي وحالة POFile.
cs: nuple. N-ta obsahuje překladovou verzi původního katalogu a stav POFile.
de: Tupel. Ein Tupel, das die übersetzte Version des ursprünglichen Katalogs und den Status der POFile enthält.
es: tupla Una tupla que contiene la versión traducida del catálogo original y el estado de POFile.
fr: tuple. Un tuple contenant la version traduite du catalogue original et l'état du POFile.
ja: タプル。元のカタログの翻訳バージョンとPOFileのステータスを含むタプル。
pl: krotka. Krotka zawierająca przetłumaczoną wersję oryginalnego katalogu i status POFile.
zh_cn: 元组。包含原始目录的翻译版本和POFile状态的元组。

source: Translates all the po files in the found languages in the locale folder.
ar: يترجم جميع ملفات po باللغات الموجودة في مجلد الإعدادات المحلية.
cs: Převede všechny po soubory v nalezených jazycích ve složce locale.
de: Übersetzt alle PO-Dateien in den gefundenen Sprachen im Gebietsschema-Ordner.
es: Traduce todos los archivos po en los idiomas encontrados en la carpeta de configuración regional.
fr: Traduit tous les fichiers po dans les langues trouvées dans le dossier locale.
ja: 見つかった言語のすべてのpoファイルをロケールフォルダに翻訳します。
pl: Przetłumaczy wszystkie pliki po w znalezionych językach w folderze ustawień regionalnych.
zh_cn: 翻译locale文件夹中找到的语言中的所有po文件。

source: Dictionary. A dictionary of po files.
ar: قاموس. قاموس من ملفات بو.
cs: Slovník. Slovník po souborů.
de: Wörterbuch. Ein Wörterbuch von Po-Dateien.
es: Diccionario. Un diccionario de archivos po.
fr: Dictionnaire. Un dictionnaire de fichiers po.
ja: 辞書。 poファイルの辞書。
pl: Słownik. Słownik plików po.
zh_cn: 字典。 po文件的字典。

source: Translates the given pot file in the specified target languages.
ar: يترجم ملف القدر المحدد باللغات المستهدفة المحددة.
cs: Převede daný soubor s hrncem ve specifikovaných cílových jazycích.
de: Übersetzt die angegebene Topfdatei in die angegebenen Zielsprachen.
es: Traduce el archivo pot dado en los idiomas de destino especificados.
fr: Traduit le fichier de pot donné dans les langues cibles spécifiées.
ja: 与えられたポットファイルを指定されたターゲット言語で翻訳します。
pl: Przetwarza dany plik pul w określonych językach docelowych.
zh_cn: 以指定的目标语言翻译给定的pot文件。

source: sequence of strings. Target language for translation.
ar: تسلسل السلاسل. اللغة الهدف للترجمة.
cs: sled řetězců. Cílový jazyk pro překlad.
de: Sequenz von Strings. Zielsprache für die Übersetzung.
es: secuencia de cadenas. Idioma de destino para la traducción.
fr: séquence de strings. Langues cible pour la traduction.
ja: 文字列のシーケンス。翻訳の対象言語。
pl: ciąg znaków. Język docelowy do tłumaczenia.
zh_cn: 字符串序列。翻译的目标语言。

source: Translates all the pot files in the pot folder in the specified target languages.
ar: يترجم جميع ملفات وعاء في مجلد وعاء باللغات الهدف المحدد.
cs: Převede všechny soubory hrnců ve složce pot v určených cílových jazycích.
de: Übersetzt alle Pot-Dateien im Pot-Ordner in den angegebenen Zielsprachen.
es: Traduce todos los archivos pot en la carpeta pot en los idiomas de destino especificados.
fr: Traduit tous les fichiers *.pot dans le dossier dans les langues cibles spécifiées.
ja: 指定したターゲット言語のpotフォルダ内のすべてのファイルを変換します。
pl: Przetłumaczy wszystkie pliki pul w folderze pot w określonych językach docelowych.
zh_cn: 以指定的目标语言翻译pot文件夹中的所有pot文件。
