Repository: SekouD/potranslator
Catalog: docs/locale/*/LC_MESSAGES/usage.po
Languages: de, es, fr, it, ja

source: Usage
de: Verwendung
es: Uso
fr: Utilisation
it: uso
ja: 使用法

source: From a Python program
de: Aus einem Python-Programm
es: Desde un programa de Python
fr: Depuis un programme Python
it: Da un programma Python
ja: Pythonプログラムから

source: To use potranslator in a python project::
de: So verwenden Sie Potranslator in einem Python-Projekt ::
es: Para usar potraSlator en un proyecto python ::
fr: Pour utiliser potranslator dans un projet python::
it: Per utilizzare il trasformatore in un progetto python ::
ja: Pythonプロジェクトでポットトランスレータを使用するには::

source: Commands, options, environment variables
de: Befehle, Optionen, Umgebungsvariablen
es: Comandos, opciones, variables de entorno
fr: Commandes, options, et variables d'environnement
it: Comandi, opzioni, variabili d'ambiente
ja: コマンド、オプション、環境変数

source: Commands
de: Befehle
es: Comandos
fr: Commandes
it: comandi
ja: コマンド

source: Type `potranslator` without arguments to show the help instructions.
de: Geben Sie `potranslator` ohne Argumente ein, um die Hilfeanweisungen anzuzeigen.
es: Escriba `potraslator` sin argumentos para mostrar las instrucciones de ayuda.
fr: Tapez `potranslator` sans arguments pour afficher les instructions d'aide.
it: Digita `potranslator` senza argomenti per mostrare le istruzioni di aiuto.
ja: help命令を表示するには、引数なしで `potranslator`とタイプしてください。

source: Setup environment variables
de: Setup-Umgebungsvariablen
es: Configurar variables de entorno
fr: Configurer les variables d'environnement
it: Imposta le variabili d'ambiente
ja: 環境変数の設定

source: All command-line options can be set with environment variables using the format POTRANSLATOR_<UPPER_LONG_NAME> . Dashes (-) have to replaced with underscores (_).
de: Alle Befehlszeilenoptionen können mit Umgebungsvariablen im Format POTRANSLATOR_ <UPPER_LONG_NAME> festgelegt werden. Bindestriche (-) müssen durch Unterstriche (_) ersetzt werden.
es: Todas las opciones de línea de comandos se pueden configurar con variables de entorno con el formato POTRANSLATOR_ <UPPER_LONG_NAME>. Los guiones (-) tienen que ser reemplazados por guiones bajos (_).
fr: Toutes les options de ligne de commande peuvent être définies avec des variables d'environnement en utilisant le format POTRANSLATOR_ <NOM_EN_MAJUSCULE>. Les tirets (-) doivent être remplacés par des traits de soulignement (_).
it: Tutte le opzioni della riga di comando possono essere impostate con variabili di ambiente utilizzando il formato POTRANSLATOR_ <UPPER_LONG_NAME>. I trattini (-) devono essere sostituiti con caratteri di sottolineatura (_).
ja: すべてのコマンドラインオプションは、POTRANSLATOR_ <UPPER_LONG_NAME>の形式で環境変数で設定できます。ダッシュ（ - ）をアンダースコア（_）に置き換える必要があります。

source: For example, to set the languages::
de: Um beispielsweise die Sprachen zu setzen:
es: Por ejemplo, para establecer los idiomas ::
fr: Par exemple, pour définir les langues ::
it: Ad esempio, per impostare le lingue ::
ja: たとえば、言語を設定するには::

source: This is the same as passing the option to potranslator directly::
de: Dies ist das Gleiche wie die direkte Übergabe der Option an den Potranslator:
es: Esto es lo mismo que pasar la opción al potasador directamente:
fr: C'est équivalent à passer l'option à potranslator directement ::
it: È lo stesso che passare direttamente l'opzione al trasformatore ::
ja: これは、オプションをpotranslatorに直接渡すのと同じです::

source: Setup sphinx conf.py
de: Richten Sie sphinx conf.py ein
es: Configuración sphinx conf.py
fr: Configurer sphinx conf.py
it: Imposta sphinx conf.py
ja: sphinx conf.pyの設定

source: Add the following settings to your sphinx document's conf.py if it exists::
de: Fügen Sie dem conf.py Ihres sphinx-Dokuments die folgenden Einstellungen hinzu, wenn es existiert:
es: Agregue las siguientes configuraciones a conf.py del documento de su esfinge si existe ::
fr: Ajoutez les paramètres suivants au fichier conf.py de votre document sphinx s'il existe:
it: Aggiungi le seguenti impostazioni alla conf.py del documento sfinge se esiste:
ja: あなたのスフィンクスドキュメントのconf.pyに次の設定を追加します：

source: Setup Makefile / make.bat
es: Configurar Makefile / make.bat
fr: Configurer Makefile / make.bat
it: Imposta Makefile / make.bat
ja: Makefile / make.batの設定

source: `make gettext` will generate pot files into `_build/gettext` directory, however pot files can be generated in the `locale/pot` if convenient. You can do that by replacing `_build/gettext` with `locale/pot` in your `Makefile` and/or `make.bat` that was generated by sphinx-quickstart.
de: `make gettext` erzeugt Pot-Dateien im` _build / gettext` -Verzeichnis, jedoch können Pot-Dateien im `locale / pot` generiert werden, wenn dies praktisch ist. Sie können das tun, indem Sie `_build / gettext` durch` locale / pot` in Ihrem `Makefile` und / oder` make.bat` ersetzen, das von sphinx-quickstart generiert wurde.
es: `make gettext` generará archivos pot en el directorio` _build / gettext`; sin embargo, los archivos pot se pueden generar en `locale / pot` si es conveniente. Puedes hacer eso reemplazando `_build / gettext` con` locale / pot` en tu `Makefile` y / o` make.bat` que fue generado por sphinx-quickstart.
fr: `make gettext` va générer des fichiers pot dans le répertoire` _build / gettext`, mais les fichiers pot peuvent être générés dans `locale / pot` si cela est plus pratique. Vous pouvez le faire en remplaçant `_build / gettext` par` locale / pot` dans votre `Makefile` et / ou ` make.bat` qui a été généré par sphinx-quickstart ou sphinx-build.
it: `make gettext` genererà i file pot nella directory` _build / gettext`, tuttavia i file pot possono essere generati nel `locale / pot`, se conveniente. Puoi farlo sostituendo `_build / gettext` con` locale / pot` nel tuo `Makefile` e / o` make.bat` che è stato generato da sphinx-quickstart.
ja: `make gettext`は` _build / gettext`ディレクトリにポットファイルを生成しますが、便利な場合は `locale / pot`でポットファイルを生成することができます。 `Makefile`や` make.bat`で `_build / gettext`を` locale / pot`に置き換えるか、sphinx-quickstartで生成された `make.bat`を置き換えてください。
